In [1]:
from chalk.client import ChalkClient
from src.models import User, Transaction

In [2]:
client = ChalkClient(branch="main")

In [4]:
ds = client.offline_query(
    input={User.id: [1]},
    output=[User],
    recompute_features=True
)
ds.to_pandas()

,user.id,user.email,user.name,user.dob,user.denylisted,user.name_email_match_score,user.emailage_response,user.email_age_days,user.domain_age_days,user.credit_report_id,user.count_food_purchases__86400__,user.count_food_purchases__604800__,user.count_food_purchases__2592000__
0,1,nicoleam@nasa.gov,Nicole Mann,1977-08-27 00:00:00+00:00,False,0.4375,"{""domainAge"": 10200, ""domainname"": ""nasa.gov"",...",2443,10200,123,0,0,0

In [3]:
client.offline_query(
    max_samples=100,
    output=[Transaction.memo, Transaction.user_id, Transaction.amount],
    recompute_features=True
).to_pandas()

,transaction.memo,transaction.user_id,transaction.amount,transaction.id
0,Starbucks 57892,1,-12.45,1
1,Starbucks 57892,1,-12.45,2
2,SQ - WALMART SUPERCENTER #345,1,-64.50,3
3,Uber ride 08/15,1,-32.78,4
4,ACH TRANSFER 1234567890,1,150.00,5
...,...,...,...,...
95,Spotify Subscription,1,-14.67,135
96,Wire Transfer 43210987,1,500.00,136
97,Waymo Ride 07/13,1,-64.89,137
98,Starbucks 78564,1,-12.45,139
99,ACH TRANSFER 2109876543,1,150.00,141